app/controllers/marks_controller.rb

  def index
    @marks = Mark.all
---
SELECT "marks".* FROM "marks"

  def create
    @mark = Mark.new(mark_params)

    respond_to do |format|
      if @mark.save
---
INSERT INTO "marks" ("m1", "m2", "m3", "m4", "m5", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["m1", 59], ["m2", 52], ["m3", 68], ["m4", 75], ["m5", 73], ["student_id", 1], ["created_at", "2022-11-28 16:01:34.856715"], ["updated_at", "2022-11-28 16:01:34.856715"]]

  def update
    respond_to do |format|
      if @mark.update(mark_params)
---
UPDATE "marks" SET "total" = ?, "percentage" = ?, "updated_at" = ? WHERE "marks"."id" = ?  [["total", 369], ["percentage", 73.0], ["updated_at", "2022-11-28 16:58:04.966198"], ["id", 2]]

  def destroy
    @mark.destroy
---
DELETE FROM "marks" WHERE "marks"."id" = ?  [["id", 7]]

    def set_mark
      @mark = Mark.find(params[:id])
---
SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]